{"name":"Summary\nEnthusiastic","summary":"Enthusiastic backend developer with 4 years of experience in web development. Proficient with REST APIs, Web\nApplications , Micro Services and Database. Experience with design patterns and best practices with Golang to\nbuild deployable production systems. Motivated to learn, grow and help team achieve company goals.\nWork History\nBACKEND ENGINEER \" 01/2019 - Current\nMAGASSIANS VOIP PRIVATE LIMITED - MUMBAI, Maharashtra\nWorked on designing, development, maintenance and documentation of golang applications.\nDeveloped microservices in golang for reading large volume of data from PostgreSQL database.\nResponsible for generating server-side code with open API specifications using Apicurio.\nWrite complex queries to fetch millions of records from PSQL, Snowflake databases.\nUsed query optimization to reduce the API response time.\nBuilt message(event) driven architecture services to achieve decoupling of producers and consumers.\nOptimised the code using Go routines. Worked with GORM to perform DB operations and add hooks.\nImplemented prometheus for monitoring and metric collection in the services.\nSecure applications using JWT and implemented cerbos for role based access.\nBuilt a GORM query plan adapter for cerbos that builds the where clause based on the access rules\nconfigured in cerbos.\nContainerise applications using Docker. Created docker files, built docker images for microservices to run on\nKubernetes platform.\nPerformed debugging and exception handling in support to software development.","education":"Shah And Anchor Kutchhi Engineering College, - Mumbai, MH \" Bachelor of Engineering\nElectronics And Telecomunication , 2017\nIndustry Knowledge: Golang, Ruby, RoR\nTechnical Skills: HTTP/HTTPS, go-chi router, Docker,\nAzure, NATS, Web Frameworks and routers, SQL\nfundamentals, PSQL, Snowflake, JWT\nSoft Skills: Problem Solving, Attention to Detail,\nLeadership, Communication, Teamwork, Self-\nmotivation, Self-starter\n."}