{"name":"Aamir Iqbal","summary":":\nProficient in Marketing\n3 years of experience in marketing.\nPROFESSIONAL EXPEREINCE :\nDuration Designation Employer / Place\nSep 2009 – Till Date Sales Executive\nMacmillan Publishers\nJune 2007 – August 2009 Sales Officer Ratna\nSagar P.Ltd\nMay 2012 – till date Sales Officer Bennett Coleman &\nCompany\nAbout the company\nMacmillan Publishers is a UK based publishing house a pioneering company\nin the field of education it is dedicated to provide quality educational\nand support material to students of all deciplines, the company has\noperations around The globe in more than 126 countries.\nMacmillan Publishes School Books, College Books, Library Books, Journals,\nGeneral and Trade Books, Magazines Etc, the books are written by prominent\nauthors and most of the titles are market leader in their respective\ncategories\nRatna Sagar is a well established brand in the field of education and it\nis engaged in the publishing of Educational books,General books,and\nDictionaries ,the company has the collaboration with Scholistics a giant\ncompany in the field of (children books) for many of its titles.\nThe company has got the the tie up with NDTV for its General books\nJob Profile\nPromote company's product line at the right time at the right place\nExplore new pockets to generate business\nKeep a close eye on competitors move\nGenerate business to meet assigned targets.\nMaintain healthy relations with the dealers and customers\nEnsure the availability of company's product within the reach of\ncustomers\nTimely collection of payment to maximize profitability of a branch\nProvide proper after sales service to customers to maximize customer\nsatisfaction.\nCOMPUTER SKILLS :\n\"C\" Language, MS-Office, HTML, DHTML,\nFrontPage, Hardware, Networking\n\"Level \"Year of Passing \"Major field of Study \"\n\"SSC \"2001 \" \"\n\"HSSC \"2003 \"Science \"\n\"B.com \"2007 \"Commerce \"\n\"MBA \"Persuing \"Marketing \"\nPERSONAL PROFILE :\nMarital Status : Unmarried\nNationality : Indian","skills":":\n\"C\" Language, MS-Office, HTML, DHTML,\nFrontPage, Hardware, Networking\n\"Level \"Year of Passing \"Major field of Study \"\n\"SSC \"2001 \" \"\n\"HSSC \"2003 \"Science \"\n\"B.com \"2007 \"Commerce \"\n\"MBA \"Persuing \"Marketing \"\nPERSONAL PROFILE :\nMarital Status : Unmarried\nNationality : Indian"}